app/controllers/products_controller.rb

INSERT INTO "products" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "title", "category", "brand", "description", "subcategory", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image_file_name", "pixi3_9990.jpg"], ["image_file_size", 15229], ["image_updated_at", "2016-10-16 17:40:27.291958"], ["updated_at", "2016-10-16 17:40:27.541572"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)